<p><font size="6"><b>Reshaping data</b></font></p>

In [3]:
%matplotlib inline

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pivoting data

## In excel:

People who know Excel, probably know the **Pivot** functionality:

![](img/pivot_excel.png)

The data of the table:

In [4]:
excelample = pd.DataFrame({'Month': ["January", "January", "January", "January", 
                                  "February", "February", "February", "February", 
                                  "March", "March", "March", "March"],
                   'Category': ["Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment"],
                   'Amount': [74., 235., 175., 100., 115., 240., 225., 125., 90., 260., 200., 120.]})

In [5]:
excelample

       Month        Category  Amount
0    January  Transportation    74.0
1    January         Grocery   235.0
2    January       Household   175.0
3    January   Entertainment   100.0
4   February  Transportation   115.0
5   February         Grocery   240.0
6   February       Household   225.0
7   February   Entertainment   125.0
8      March  Transportation    90.0
9      March         Grocery   260.0
10     March       Household   200.0
11     March   Entertainment   120.0

In [6]:
excelample_pivot = excelample.pivot(index="Category", columns="Month", values="Amount")
excelample_pivot

Month           February  January  March
Category
Entertainment      125.0    100.0  120.0
Grocery            240.0    235.0  260.0
Household          225.0    175.0  200.0
Transportation     115.0     74.0   90.0

Interested in *Grand totals*?

In [7]:
# sum columns
excelample_pivot.sum(axis=1)

Category
Entertainment     345.0
Grocery           735.0
Household         600.0
Transportation    279.0
dtype: float64

In [8]:
# sum rows
excelample_pivot.sum(axis=0)

Month
February    705.0
January     584.0
March       670.0
dtype: float64

## Pivot is just reordering your data

Small subsample of the titanic dataset:

In [9]:
df = pd.DataFrame({'Fare': [7.25, 71.2833, 51.8625, 30.0708, 7.8542, 13.0],
                   'Pclass': [3, 1, 1, 2, 3, 2],
                   'Gender': ['male', 'female', 'male', 'female', 'female', 'male'],
                   'Survived': [0, 1, 0, 1, 0, 1]})

In [10]:
df

      Fare  Pclass  Gender  Survived
0   7.2500       3    male         0
1  71.2833       1  female         1
2  51.8625       1    male         0
3  30.0708       2  female         1
4   7.8542       3  female         0
5  13.0000       2    male         1

In [11]:
df.pivot(index='Pclass', columns='Gender', values='Fare')

Gender   female     male
Pclass
1       71.2833  51.8625
2       30.0708  13.0000
3        7.8542   7.2500

In [12]:
df.pivot(index='Pclass', columns='Gender', values='Survived')

Gender  female  male
Pclass
1            1     0
2            1     1
3            0     0

So far, so good...

Let's now use the full titanic dataset:

In [13]:
df = pd.read_csv("data/titanic.csv")

In [14]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

And try the same pivot (*no worries about the try-except, this is here just used to catch a long error*):

In [15]:
try:
    df.pivot(index='Gender', columns='Pclass', values='Fare')
except Exception as e:
    print("Exception!", e)

Exception! Index contains duplicate entries, cannot reshape

This does not work, because we would end up with multiple values for one cell of the resulting frame, as the error says: `duplicated` values for the columns in the selection. As an example, consider the following rows of our three columns of interest:

In [16]:
df.loc[[1, 3], ["Gender", 'Pclass', 'Fare']]

   Gender  Pclass     Fare
1  female       1  71.2833
3  female       1  53.1000

Since `pivot` is just restructuring data, where would both values of `Fare` for the same combination of `Gender` and `Pclass` need to go?

Well, they need to be combined, according to an `aggregation` functionality, which is supported by the function`pivot_table`

<div class="alert alert-danger">

<b>NOTE</b>:

 <ul>
  <li>**Pivot** is purely restructuring: a single value for each index/column combination is required.</li>
</ul>
</div>

# Pivot tables - aggregating while pivoting

In [ ]:
df = pd.read_csv("data/titanic.csv")

In [ ]:
df.pivot_table(index='Gender', columns='Pclass', values='Fare')

<div class="alert alert-info">

<b>REMEMBER</b>:

 <ul>
  <li>By default, `pivot_table` takes the **mean** of all values that would end up into one cell. However, you can also specify other aggregation functions using the `aggfunc` keyword.</li>
</ul>
</div>

In [ ]:
df.pivot_table(index='Gender', columns='Pclass', 
               values='Fare', aggfunc='max')

In [ ]:
df.pivot_table(index='Gender', columns='Pclass', 
               values='PassengerId', aggfunc='count')

<div class="alert alert-info">

<b>REMEMBER</b>:

 <ul>
  <li>There is a shortcut function for a `pivot_table` with a `aggfunc=count` as aggregation: `crosstab`</li>
</ul>
</div>

In [ ]:
pd.crosstab(index=df['Gender'], columns=df['Pclass'])

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Make a pivot table with the survival rates (= number of persons survived / total number of persons) for Pclass vs Gender.
</ul>
</div>

In [ ]:
# %load snippets/06 - Reshaping data20.py

# Melt

The `melt` function performs the inverse operation of a `pivot`. This can be used to make your frame longer, i.e. to make a *tidy* version of your data.

In [19]:
pivoted = df.pivot_table(index='Gender', columns='Pclass', values='Fare').reset_index()
pivoted.columns.name = None

In [20]:
pivoted

   Gender           1          2          3
0  female  106.125798  21.970121  16.118810
1    male   67.226127  19.741782  12.661633

Assume we have a DataFrame like the above. The observations (the average Fare people payed) are spread over different columns. In a tidy dataset, each observation is stored in one row. To obtain this, we can use the `melt` function:

In [21]:
pd.melt(pivoted)

  variable    value
0   Gender   female
1   Gender     male
2        1  106.126
3        1  67.2261
4        2  21.9701
5        2  19.7418
6        3  16.1188
7        3  12.6616

As you can see above, the `melt` function puts all column labels in one column, and all values in a second column.

In this case, this is not fully what we want. We would like to keep the 'Gender' column separately:

In [ ]:
pd.melt?

In [22]:
pd.melt(pivoted, id_vars=['Gender'] , var_name='Pclass', value_name='Fare')

   Gender Pclass        Fare
0  female      1  106.125798
1    male      1   67.226127
2  female      2   21.970121
3    male      2   19.741782
4  female      3   16.118810
5    male      3   12.661633

# Reshaping with `stack` and `unstack`

The docs say:

> Pivot a level of the (possibly hierarchical) column labels, returning a
DataFrame (or Series in the case of an object with a single level of
column labels) having a hierarchical index with a new inner-most level
of row labels.

Indeed... 
<img src="img/schema-stack.svg" width=50%>

Before we speak about `hierarchical index`, first check it in practice on the following dummy example:

In [23]:
df = pd.DataFrame({'A':['one', 'one', 'two', 'two'], 
                   'B':['a', 'b', 'a', 'b'], 
                   'C':range(4)})
df

     A  B  C
0  one  a  0
1  one  b  1
2  two  a  2
3  two  b  3

To use `stack`/`unstack`, we need the values we want to shift from rows to columns or the other way around as the index:

In [24]:
df = df.set_index(['A', 'B']) # Indeed, you can combine two indices
df

       C
A   B
one a  0
    b  1
two a  2
    b  3

In [25]:
result = df['C'].unstack(1)
result

B    a  b
A
one  0  1
two  2  3

In [26]:
df = result.stack().reset_index(name='C')
df

     A  B  C
0  one  a  0
1  one  b  1
2  two  a  2
3  two  b  3

<div class="alert alert-info">

<b>REMEMBER</b>:

 <ul>
  <li>**stack**: make your data *longer* and *leaner* </li>
  <li>**unstack**: make your data *shorter* and *wider* </li>
</ul>
</div>

## Mimick pivot table

To better understand and reason about pivot tables, we can express this method as a combination of more basic steps. In short, the pivot is a convenient way of expressing the combination of a `groupby` and `stack/unstack`.

In [27]:
df = pd.read_csv("data/titanic.csv")

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df.pivot_table(index='Pclass', columns='Gender', 
               values='Survived', aggfunc='mean')

Gender    female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

<div class="alert alert-success">

<b>QUESTION</b>:

 <ul>
  <li>Get the same result as above based on a combination of `groupby` and `unstack`</li>
  <li>First use `groupby` to calculate the survival ratio for all groups</li>
  <li>Then, use `unstack` to reshape the output of the groupby operation</li>
</ul>
</div>

In [30]:
df.groupby(['Pclass', 'Gender'])['Survived'].mean().unstack()

Gender    female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

## Mimick melt

Like the pivot table above, we can now also obtain the result of `melt` with stack/unstack.

Let's use the same `pivoted` frame as above, and look at the final melt result:

In [31]:
pivoted = df.pivot_table(index='Gender', columns='Pclass', values='Fare').reset_index()
pivoted.columns.name = None
pivoted

   Gender           1          2          3
0  female  106.125798  21.970121  16.118810
1    male   67.226127  19.741782  12.661633

In [32]:
pd.melt(pivoted, id_vars=['Gender'], var_name='Pclass', value_name='Fare')

   Gender Pclass        Fare
0  female      1  106.125798
1    male      1   67.226127
2  female      2   21.970121
3    male      2   19.741782
4  female      3   16.118810
5    male      3   12.661633

<div class="alert alert-success">

<b>QUESTION</b>:

 <ul>
  <li>Get the same result as above using `stack`/`unstack` (combined with `set_index` / `reset_index`)</li>
  <li>Tip: set those columns as the index that you do not want to stack</li>
</ul>
</div>

In [33]:
temp = pivoted.set_index('Gender').stack().reset_index()
temp

   Gender  level_1           0
0  female        1  106.125798
1  female        2   21.970121
2  female        3   16.118810
3    male        1   67.226127
4    male        2   19.741782
5    male        3   12.661633

In [34]:
temp.rename(columns={'level_1': 'Pclass', 0: 'Fare'})

   Gender  Pclass        Fare
0  female       1  106.125798
1  female       2   21.970121
2  female       3   16.118810
3    male       1   67.226127
4    male       2   19.741782
5    male       3   12.661633

# Exercises: use the reshaping methods with the movie data

In [35]:
cast = pd.read_csv('data/cast_sample.csv')
cast.head()

,title,name,type,character,n
0,Suuri illusioni,Homo $,actor,Guests,22.0
1,When the Man Went South,Taipaleti 'Atu'ake,actor,Two Palms - Ua'i Paame,8.0
2,B-Girl,Jesse 'Casper' Brown,actor,Battle Judge,25.0
3,Kickin' It Old Skool,Jesse 'Casper' Brown,actor,Cole,10.0
4,Heron's Story,David 'Jumbles' Cook,actor,Man at Bar 3,NaN

In [36]:
titles = pd.read_csv('data/titles_sample.csv')
titles.head()

                                     title  year
0                      A Still Small Voice  2005
1  The Interims: When Between Time & Place  2017
2                                     E ke  1972
3                   Don't Go Near the Park  1979
4                      36 Chowringhee Lane  1981

In [37]:
cast = cast.merge(titles)

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Plot the number of actor roles each year and the number of actress roles each year over the whole period of available movie data.</li>
</ul>
</div>

In [ ]:
cast.head()

In [ ]:
# %load snippets/06 - Reshaping data46.py
grouped = cast.groupby(['year', 'type']).size()
table = grouped.unstack('type')
table.plot()

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Plot the number of actor roles each year and the number of actress roles each year. Use kind='area' as plot type</li>
</ul>
</div>

In [ ]:
# %load snippets/06 - Reshaping data49.py